Revit 2027 API
ViewNode.ViewId Property
 The Id of the view element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ViewId { get; }
Public ReadOnly Property ViewId As ElementId
	Get
public:
property ElementId^ ViewId {
	ElementId^ get ();
}
member ViewId : ElementId with get
Property Value
ElementId
See Also
Reference
ViewNode Class
Autodesk.Revit.DB Namespace